In [1]:
import pandas as pd
import numpy as np

In [9]:
s_int = pd.Series([1.1,2,3,4,5])

In [10]:
print(s_int)
s_int.index

0    1.1
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

RangeIndex(start=0, stop=5, step=1)

In [14]:
s_int.values

array([1.1, 2. , 3. , 4. , 5. ])

In [15]:
s_int.to_list()

[1.1, 2.0, 3.0, 4.0, 5.0]

In [16]:
np.max(s_int)

5.0

In [17]:
s = pd.Series([2,3,4], index=["a", "b", "c"])

In [18]:
s

a    2
b    3
c    4
dtype: int64

In [19]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [20]:
s

a    2
b    3
c    4
dtype: int64

In [21]:
s[1]

/tmp/ipykernel_7176/878419959.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

3

In [23]:
s["a"] = 22

In [24]:
s

a    22
b     3
c     4
dtype: int64

In [25]:
purity_dictionary = {
"Ali" : 19 ,
"Gholi" : 16 ,
"Vali" : 20
}

In [26]:
ps = pd.Series(purity_dictionary)

In [27]:
ps

Ali      19
Gholi    16
Vali     20
dtype: int64

In [28]:
cars_dictionary = {
    "model" :[ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"],
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}
cars_dictionary

{'model': ['Peykan',
  'BMW X6',
  'Peugeot 206',
  'Tiba',
  'Nissan Junior',
  'Peykan Vanet',
  'renault 5'],
 'Color': ['Red', 'White', 'Black', 'White', 'Blue', 'Red', 'Silver'],
 'HP': [48, 335, 105, 87, 93, 80, 48],
 'Weight (KG)': [990, 2320, 1025, 1027, 1540, 960, 850],
 'price': [33, 2400, 105, 120, 230, 68, 38]}

In [33]:
df = pd.DataFrame(cars_dictionary)
df

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [34]:
df.columns

Index(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype='object')

In [35]:
type(df.columns)

pandas.core.indexes.base.Index

In [36]:
df.columns.tolist()

['model', 'Color', 'HP', 'Weight (KG)', 'price']

In [37]:
df.columns.to_numpy()

array(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype=object)

In [38]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [40]:
type(df.Color)

pandas.core.series.Series

In [41]:
df["Color"]

0       Red
1     White
2     Black
3     White
4      Blue
5       Red
6    Silver
Name: Color, dtype: object

In [48]:
df.iloc[0]
df.iloc[0].to_numpy()

array(['Peykan', 'Red', 48, 990, 33], dtype=object)

In [43]:
type(df.iloc[0])

pandas.core.series.Series

In [49]:
df.values

array([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Peykan Vanet', 'Red', 80, 960, 68],
       ['renault 5', 'Silver', 48, 850, 38]], dtype=object)

In [50]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]])
df2

               0       1    2     3     4
0         Peykan     Red   48   990    33
1         BMW X6   White  335  2320  2400
2    Peugeot 206   Black  105  1025   105
3           Tiba   White   87  1027   120
4  Nissan Junior    Blue   93  1540   230
5  Nissan Junior     Red   93  1540   186
6      renault 5  Silver   48   850    38

In [57]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]],
       index = ['a','b','c','d','e','f','g'],
       columns= ['model' , 'Color' , 'HP', 'Weight (KG)', 'price'])
df2

           model   Color   HP  Weight (KG)  price
a         Peykan     Red   48          990     33
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

In [54]:
df2.iloc[0]

model          Peykan
Color             Red
HP                 48
Weight (KG)       990
price              33
Name: a, dtype: object

In [61]:
df2.loc["a"]

model          Peykan
Color             Red
HP                 48
Weight (KG)       990
price              33
Name: a, dtype: object

In [62]:
df = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]],
       index = ['a','b','c','d','e','f','g'],
       columns= ['model' , 'Color' , 'HP', 'Weight (KG)', 'price'])
df

           model   Color   HP  Weight (KG)  price
a         Peykan     Red   48          990     33
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

In [63]:
df.head()

           model  Color   HP  Weight (KG)  price
a         Peykan    Red   48          990     33
b         BMW X6  White  335         2320   2400
c    Peugeot 206  Black  105         1025    105
d           Tiba  White   87         1027    120
e  Nissan Junior   Blue   93         1540    230

In [65]:
df.tail(6)

           model   Color   HP  Weight (KG)  price
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

In [69]:
df.sample(4, random_state=12)

           model  Color   HP  Weight (KG)  price
e  Nissan Junior   Blue   93         1540    230
f  Nissan Junior    Red   93         1540    186
a         Peykan    Red   48          990     33
c    Peugeot 206  Black  105         1025    105

In [72]:
df.sample(frac=0.4, random_state=13, ignore_index=True)

           model  Color   HP  Weight (KG)  price
0         BMW X6  White  335         2320   2400
1           Tiba  White   87         1027    120
2  Nissan Junior   Blue   93         1540    230

In [73]:
df.sample(frac=0.4, random_state=13)

           model  Color   HP  Weight (KG)  price
b         BMW X6  White  335         2320   2400
d           Tiba  White   87         1027    120
e  Nissan Junior   Blue   93         1540    230

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a to g
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   model        7 non-null      object
 1   Color        7 non-null      object
 2   HP           7 non-null      int64
 3   Weight (KG)  7 non-null      int64
 4   price        7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 336.0+ bytes

In [75]:
df.describe()

               HP  Weight (KG)        price
count    7.000000     7.000000     7.000000
mean   115.571429  1327.428571   444.571429
std     99.354344   516.250539   865.250225
min     48.000000   850.000000    33.000000
25%     67.500000  1007.500000    71.500000
50%     93.000000  1027.000000   120.000000
75%     99.000000  1540.000000   208.000000
max    335.000000  2320.000000  2400.000000

In [79]:
df.Color.value_counts(normalize=True)

Color
Red       0.285714
White     0.285714
Black     0.142857
Blue      0.142857
Silver    0.142857
Name: proportion, dtype: float64

In [2]:
import pandas as pd
import numpy as np
cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary , index = [ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"])

df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [16]:
df.iloc[2]

Color          Black
HP               105
Weight (KG)     1025
price            105
Name: Peugeot 206, dtype: object

In [17]:
df.loc["Tiba"]

Color          White
HP                87
Weight (KG)     1027
price            120
Name: Tiba, dtype: object

In [18]:
df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [28]:
df.iloc[0,1]

1

In [25]:
df

                Color   HP  Weight (KG)  price
Peykan            Red    1          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [26]:
df

                Color   HP  Weight (KG)  price
Peykan            Red    1          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [30]:
df.iloc[[0,1], 1]

Peykan      1
BMW X6    335
Name: HP, dtype: int64

In [38]:
df.loc[["Tiba", "Peykan"], ["Color","price"]]

        Color  price
Tiba    White    120
Peykan    Red     33

In [39]:
type(df.loc[["Tiba", "Peykan"], ["Color","price"]])

pandas.core.frame.DataFrame

In [40]:
df.iloc[2,3]

105

In [41]:
df.iloc[[2,3]]

             Color   HP  Weight (KG)  price
Peugeot 206  Black  105         1025    105
Tiba         White   87         1027    120